БИТУправление_медицинским_центром_демо/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЕдиницы</name>
    <type>
      <types>EnumRef.ТипыЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЛекарственныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостоитИзДругихУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВПотребительскойУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложеннаяУпаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыЕдиницИзмерения/ТипыЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЕдиницИзмерения</name>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ОбычнаяЕдиницаИзмерения</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ЕдиницыИзмерения/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		ТипЕдиницы = Неопределено;
		Если Параметры.Свойство("Ключ") И Не Параметры.Ключ.Пустая() Тогда
			ТипЕдиницы = Параметры.Ключ.ТипЕдиницы;
		ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") Тогда
			Если Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") Тогда
				ТипЕдиницы = Перечисления.ТипыЕдиницИзмерения.Упаковка;
				Параметры.ЗначенияЗаполнения.Вставить("ТипЕдиницы", ТипЕдиницы);
			Иначе
				Параметры.ЗначенияЗаполнения.Свойство("ТипЕдиницы", ТипЕдиницы);
			КонецЕсли;
		ИначеЕсли Параметры.Свойство("ЗначениеКопирования") Тогда
			ТипЕдиницы = Параметры.ЗначениеКопирования.ТипЕдиницы;
		КонецЕсли;
		
		Если ТипЕдиницы = Перечисления.ТипыЕдиницИзмерения.Упаковка Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаУпаковкиНоменклатуры";
		КонецЕсли;
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
		Если Параметры.Свойство("ВыборУпаковкиНоменклатуры") Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаВыбораУпаковокНоменклатуры";
		ИначеЕсли Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаВыбораЕдиницИзмеренияНоменклатуры";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  

#Область ПрограммныйИнтерфейс

// Возвращает количество базовых единиц номенклатуры в упаковке
//
// Параметры:
//  Объект - СправочникСсылка.ЕдиницыИзмерения,СправочникСсылка.Номенклатура  - упаковка/номенклатура
// 
// Возвращаемое значение:
//  Число - количество базовых единиц номенклатуры в упаковке
//
Функция ПолучитьКоличествоБазовыхЕдиницВУпаковке(Объект) Экспорт
	
	Упаковка = ?(ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура"), Объект.Упаковка, Объект);	
	
	Если Упаковка <> Неопределено Тогда
		Если Упаковка.ТипЕдиницы = Перечисления.ТипыЕдиницИзмерения.Упаковка Тогда
			Если Упаковка.СостоитИзДругихУпаковок Тогда
				Возврат Упаковка.КоличествоВУпаковке * ПолучитьКоличествоБазовыхЕдиницВУпаковке(Упаковка.ВложеннаяУпаковка);		
			Иначе
				Возврат Упаковка.Коэффициент * ПолучитьКоличествоБазовыхЕдиницВУпаковке(Упаковка.БазоваяЕдиницаИзмерения);	
			КонецЕсли;
		Иначе
			Возврат Упаковка.Коэффициент;	
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
